{
  "main": {
    "name": "Will Powell",
    "occupation": "Mechanical and electrical engineer.",
    "image": "ProfileNoBackground.png",
    "bio": "I am currently pursuing my MSc in Applied Machine Learning at Imperial College London. This website showcases my engineering and programming projects - like this one.",
    "contactmessage": "Contact me via email: ",
    "email": "me@willpowell.uk",
    "address": {
      "street": "Highstreet",
      "city": "Sevenoaks",
      "state": "Kent",
      "zip": "TN15"
    },
    "phone": "(+44) 7741 457169",
    "website": "willpowell.uk",
    "resumedownload": "files/William Powell CV.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/william-f-powell/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/willpowelluk",
        "className": "fa fa-github"
      },
      {
        "name": "youtube",
        "url": "https://www.youtube.com/channel/UCIZGeka3qGytWd5Qf2cm9yA/videos",
        "className": "fa fa-youtube"
      },
      {
        "name": "photography",
        "url": "https://photography.willpowell.uk/",
        "className": "fa fa-camera"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Imperial College London",
        "degree": "Masters in Applied Machine Learning",
        "graduated": "September 2023 - Present",
        "description": ""
      },
      {
        "school": "University Of Bath",
        "degree": "Bachelors in Integrated Mechanical and Electrical Engineering",
        "graduated": "September 2019 - June 2023",
        "description": "First Class Honours with 75% overall. See the Portfolio section for my dissertation."
      },
      {
        "school": "Sevenoaks School",
        "degree": "International Baccalaureate (IB)",
        "graduated": "September 2017 - May 2019",
        "description": "Higher Levels: Maths, Physics and Biology. Standard Levels: Russian, Psychology, Literature and Performance."
      }
    ],
    "work": [
      {
        "company": "BrainPatch",
        "title": "Product Development Contractor",
        "years": "June 2021 - Present",
        "description": "BrainPatch is a cutting edge neurotech start-up who aim to create an appstore for the brain. After a previous internship working alongside the CTO to assemble and test a prototype circuit that will be used for vestibular stimulation, I went on to design a wireless EEG/ECG recording device. This involved writing firmware in C++ to remotely record and stream data to a server and subsequently web-app written in Python. I also developed the electronics and PCB for this device. Subsequently, this device was used to detect stress through machine learning methods in my Final Year Project."
      },
      {
        "company": "AB Dynamics",
        "title": "Software Engineer Intern",
        "years": "September 2021 - August 2022",
        "description": "AB Dynamics is an automotive testing company, with a vast range of products from steering robots to driving simulators. I joined as a software engineer and was the embedded lead for a new MISRA compliant product. This involved processing real-time automotive data using CAN and writing drivers, in C++, for the various peripherals of the STM32 microcontroller. Additionally, to this project, I identified the vast potential for using vestibular stimulation on the static driving simulator that could emulate dynamic motion. After the approval for a feasibility study, I integrated the simulator's environment with BrainPatch's stimulators with the driving simulators to create the sensation of rotational forces. I worked closely with the embedded team, writing C++ for both the stimulator’s firmware and the server software. I am continuing to research vestibular stimulation for emulating motion."
      },
      {
        "company": "PhoneCave",
        "title": "Founder and CEO",
        "years": "November 2019 - September 2020",
        "description": "After being frustrated with my friends' (and my own) obsession with smartphones, I created a start-up, PhoneCave, that aims to get people off their phones. I wanted to design a gadget that can be used for social situations, to have conversations without distractions, to improve productivity and mindfulness. PhoneCave is a simple idea - a lock box for your phone, keeping it out of reach for as long as you set it. I learnt enormously from starting this business – greatly improving my programming (firmware written in C++), CAD skills, electronics and PCB design. I also learnt new skills like 3d printing manufacturing, web design and marketing. PhoneCave has also increased my entrepreneurial grit. There were an enormous number of problems to overcome, crucially finding suppliers to cut costs and streamlining manufacturing. I have shipped PhoneCaves to over 10 countries worldwide, held a promotional campaign on kickstarter and seeked investors. This startup is on hold, as it requires significant funding for injection moulding."
      }
    ],
    "skills": [
      {
        "name": "PCB Design",
        "level": "70%"
      },
      {
        "name": "CAD",
        "level": "60%"
      },
      {
        "name": "C / C++ / Go",
        "level": "80%"
      },
      {
        "name": "MATLAB",
        "level": "60%"
      },
      {
        "name": "Python",
        "level": "70%"
      },
      {
        "name": "TensorFlow / Pytorch",
        "level": "60%"
      },
      {
        "name": "Web Dev (JS/ReactJS/HTML)",
        "level": "50%"
      },
      {
        "name": "Bash",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "EEG Recording Device with Machine Learning for Stress Classification.",
        "category": "My Bachelor's Dissertation: Design and Implementation of a Single-Lead Chest Strap ECG Recorder for Stress Classification using Machine Learning Methods.",
        "image": "images/EEGRecordingDevice.png",
        "url": "files/bachelorsDissertation.pdf"
      },
      {
        "title": "PhoneCave",
        "category": "My first start-up. Check out its website.",
        "image": "images/PhoneCave.png",
        "url": "https://will63powell.wixsite.com/phonecave"
      },
      {
        "title": "Neuro-Tech for Driving Simulators",
        "category": "Enhancing the Realism of Driving Simulators using Galvanic Vestibular Stimulation Motion Cueing.",
        "image": "images/OVR_Configuration.png",
        "url": "files/Enhancing_the_Realism_of_Driving_Simulators_using_Galvanic_Vestibular_Stimulation_Motion_Cueing.pdf"      
      },
      {
        "title": "Chess AI",
        "category": "Building a Chess Engine with AI in Python. Using Minimax Recursion, Negamax and Alpha Beta Pruning for computational optimisation.",
        "image": "images/ChessAIDemoR.jpg",
        "url": "https://github.com/willpowelluk/Chess-AI-with-Pruning"
      },
      {
        "title": "Space Shuttle Tile",
        "category": "Calculating the minimum tile thickness of a heat resistant tile during re-entry to earth's atmosphere. Investigation into numerical approximation methods derived from Partial Differential Equations. Modelling and GUI written in MATLAB. ",
        "image": "images/SpaceShuttle.jpg",
        "url": "files/Modelling Techniques 2 Report.pdf"
      },
      {
        "title": "Design of a Self-Organising Multi-Agent System",
        "category": "Working alongside 40+ students, I helped to lead the infrastructure team to design an environment for a Self-Organising Multi-Agent system to operate in, written in Go.",
        "image": "images/SOMAS.jpg",
        "url": "https://github.com/SOMAS2023/SOMAS2023"      
      },
      {
        "title": "Project built for the STM32 using MBED-OS",
        "category": "Since most of my projects are kept under the hood in private repositories, I thought I'd share this Uni project which doesn't have any NDAs.",
        "image": "images/MBED-OS.png",
        "url": "https://github.com/WillPowellUk/MBED-Fan-Controller"
      },
      {
        "title": "Why the Electrification of Vehicles Holds a Large Threat for the Survival of Legacy Automotive Companies",
        "category": "My reasoning as to why electrification may be the grand reset for the automotive market.",
        "image": "images/EV.png",
        "url": "files/Why the Electrification of Vehicles Holds a Large Threat for the Survival of Legacy Automotive Companies.pdf"
      },
      {
        "title": "",
        "image": "images/transparent.jpg"
      },
      {
        "title": "DoorDash Labs - Robotics and Automation of Home Deliveries",
        "category": "DoorDash is an impressive company. Started by 4 Staford Grads in 2013 this country now has a market cap of $24Bn. DoorDash is a perfect demonstrator of how to scale a buisness. I am intrigued what their new robots division, DoorDash Labs, will do for the company.",
        "image": "images/DOORDASH.png",
        "url": "files/DoorDash Labs - Robotics and Automation of Home Deliveries.pdf"
      },
      {
        "title": "Another website I designed",
        "category": "This website was designed for the University of Bath Architecture Magazine, Paperspace.",
        "image": "images/Paperspace.png",
        "url": "https://paperspacemagazine.com"
      }
    ]
  }
}
