{
  "main": {
    "name": "Will Powell",
    "occupation": "Soon to be mechanical and electrical engineer.",
    "description": "",
    "image": "ProfileNoBackground.png",
    "bio": "I am currently studying Mechanical and Electrical Engineering at the University of Bath. This website showcases my engineering and programming projects - like this one.",
    "contactmessage": "Contact me via email: ",
    "email": "me@willpowell.uk",
    "address": {
      "street": "(Your Street)",
      "city": "(Your City)",
      "state": "(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "phone": "(+44) 7741 457169",
    "website": "willpowell.uk",
    "resumedownload": "files/William-Powell-CV.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/william-f-powell/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/willpowelluk",
        "className": "fa fa-github"
      },
      {
        "name": "youtube",
        "url": "https://www.youtube.com/channel/UCIZGeka3qGytWd5Qf2cm9yA/videos",
        "className": "fa fa-youtube"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "University Of Bath",
        "degree": "Bachelors in Integrated Mechanical and Electrical Engineering",
        "graduated": "July 2022 - Present",
        "description": ""
      },
      {
        "school": "Sevenoaks School",
        "degree": "International Baccalaureate (IB)",
        "graduated": "May 2019",
        "description": "Higher Level: Maths, Physics and Biology. Standard Level: Russian, Psychology, Literature and Performance"
      }
    ],
    "work": [
      {
        "company": "BrainPatch",
        "title": "Product Development Contractor",
        "years": "Commenced June 2021",
        "description": "BrainPatch is a cutting edge neurotech start-up who aim to create an appstore for the brain. After a previous internship working alongside the CTO to assemble and test a prototype circuit that will be used for vestibular stimulation, I then went on to design an wireless EEG/ECG recording device. This involved writing firmware in C++ to remotely record and stream data to a server and subsequently web-app written in Python. I also developed the electronics and PCB for this device. I cannot detail further as BrainPatch is filing for a patent on this design. I am continuing to work on its development, alongside other contracted work."
      },
      {
        "company": "AB Dynamics",
        "title": "Software Engineer Intern",
        "years": "September 2021 - August 2022",
        "description": "AB Dynamics is an automotive testing company, with a vast range of products from steering robots to driving simulators. I joined as a software engineer and was the embedded lead for a new product, which involved processing real-time automotive data using CAN and writing drivers, in C++, for the various peripherals of the STM32 microcontroller. Additionally to this project, I identified the vast potential for using vestibular stimulation on the static driving simulator that could emulate dynamic motion. After the approval for a feasibility study, I integrated the simulator's environment with BrainPatch's stimulators with the driving simulators to create the sensation of rotational forces. I worked closely with the embedded team, writing C++ for both the stimulator’s firmware and the server software. I am continuing to research vestibular stimulation for emulating motion and will be collaborating with UCL’s Department of Psychological Sciences next month."
      },
      {
        "company": "PhoneCave",
        "title": "Founder and CEO",
        "years": "Commenced November 2019",
        "description": "After being frustrated with my friends' (and my own) obsession with smartphones, I created a start-up, PhoneCave, that aims to get people off their phones. I wanted to design a gadget that can be used for social situations, to have conversations without distractions, to improve productivity and mindfulness. PhoneCave is a simple idea - a lock box for your phone, keeping it out of reach for as long as you set it. I learnt enormously from starting this business – greatly improving my programming (firmware written in C++), CAD skills, electronics and PCB design. I also learnt new skills like 3d printing manufacturing, web design and marketing. PhoneCave has also increased my entrepreneurial grit. There were an enormous number of problems to overcome, crucially finding suppliers to cut costs and streamlining manufacturing. I have shipped PhoneCaves to over 10 countries worldwide, held a promotional campaign on kickstarter and seeked investors. This startup is on hold, as it requires significant funding for injection moulding."
      }
    ],
    "skills": [
      {
        "name": "PCB Design",
        "level": "70%"
      },
      {
        "name": "CAD",
        "level": "60%"
      },
      {
        "name": "C / C++",
        "level": "80%"
      },
      {
        "name": "MATLAB",
        "level": "60%"
      },
      {
        "name": "Python",
        "level": "70%"
      },
      {
        "name": "Web Dev",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "EEG Recording Device",
        "category": "Contracted for BrainPatch. Currently being filed for a patent so cannot detail further.",
        "image": "images/EEGRecordingDevice.png",
        "url": "https://brainpatch.ai"
      },
      {
        "title": "PhoneCave",
        "category": "My first start-up. Check out its website.",
        "image": "images/PhoneCave.png",
        "url": "https://will63powell.wixsite.com/phonecave"
      },
      {
        "title": "Chess AI",
        "category": "Building a Chess Engine with AI in Python. Optimised using alpha and beta pruning.",
        "image": "images/ChessAIDemoR.jpg",
        "url": "https://github.com/willpowelluk/Chess-AI-with-Pruning"
      },
      {
        "title": "Space Shuttle Tile",
        "category": "Calculating the minimum tile thickness of a heat resistant tile during re-entry to earth's atmosphere. Investigation into numerical approximation methods derived from Partial Differential Equations. Modelling and GUI written in MATLAB. ",
        "image": "images/SpaceShuttle.jpg",
        "url": "files/Modelling Techniques 2 Report.pdf"
      },
      {
        "title": "Closed Loop Control of an Automated Vehicle",
        "category": "This report shows the design and simulation of a closed loop system in controlling a vehicle's lateral position. ",
        "image": "images/PeakDetector.png",
        "url": "files/Control Systems Report.pdf"
      }
    ]
  }
}
